docs/jmeter/tests/JDBC_OUTBOX_EXAMPLE.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Mysql Configuration" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">select 1</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://127.0.0.1:3306/outbox</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">root</stringProp>
          <stringProp name="poolMax">40</stringProp>
          <boolProp name="preinit">true</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">root</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <RandomController guiclass="RandomControlGui" testclass="RandomController" testname="Random Controller" enabled="true">
          <intProp name="InterleaveControl.style">1</intProp>
        </RandomController>
        <hashTree>
          <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Simple Controller" enabled="true"/>
          <hashTree>
            <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="InsertRandomDataOutBoxJDBCRequest" enabled="true">
              <stringProp name="dataSource">myDatabase</stringProp>
              <stringProp name="query">insert into outbox (id, message, created_at) values (UUID(), &apos;{&quot;name&quot;:&quot;Weekly User Test&quot;, &quot;email&quot;: &quot;weekly_user@test.com&quot;,&quot;uuid&quot;:&quot;teste&quot;}&apos;, now());</stringProp>
              <stringProp name="queryType">Callable Statement</stringProp>
              <stringProp name="resultSetHandler">Store as String</stringProp>
            </JDBCSampler>
            <hashTree>
              <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
                <stringProp name="cacheKey">true</stringProp>
                <stringProp name="script">//String uuid = UUID.randomUUID().toString();
//String message = &quot;{\&quot;name\&quot;:\&quot;example\&quot;, \&quot;email\&quot;: \&quot;adrianolaselva@gmail.com\&quot;,\&quot;uuid\&quot;:\&quot;ee8699ef-bbbc-4e20-91ff-4579690dae55\&quot;,\&quot;created_at\&quot;:\&quot;2022-08-09T20:30:48.908+00:00\&quot;,\&quot;properties\&quot;:{}}&quot;;
//String now = &quot;${__time(yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;)}&quot;;
//
//String[] typeList = new String[] { &quot;RANDOM_1&quot;, &quot;RANDOM_2&quot;, &quot;RANDOM_3&quot; };
//String type = typeList[new Random().nextInt(typeList.length)];
//
//String[] statusList = new String[] { &quot;ACTIVE&quot;, &quot;INACTIVE&quot;, &quot;CANCELED&quot; };
//String status = statusList[new Random().nextInt(statusList.length)];
//
//float amount = new Random().nextFloat(1000);
//
//vars.put(&quot;UUID&quot;, uuid);
//vars.put(&quot;MESSAGE&quot;, UUID.randomUUID().toString());
//vars.put(&quot;NOW&quot;, now);
//vars.put(&quot;STATUS&quot;, now);
//vars.put(&quot;AMOUNT&quot;, amount.toString());
//vars.put(&quot;TYPE&quot;, type);</stringProp>
                <stringProp name="scriptLanguage">java</stringProp>
              </JSR223PreProcessor>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>